---
kind: property
id: P:Autodesk.Revit.DB.TextNode.UpDirection
source: html/d8a9b271-1309-17f2-141f-2ef61ef1f132.htm
---
# Autodesk.Revit.DB.TextNode.UpDirection Property

Direction along the vertical axis of letters of the text object in model space.

## Syntax (C#)
```csharp
public XYZ UpDirection { get; }
```